[
  {
    "path": "Posts/2021-10-14-mlsshiny/",
    "title": "2021 MLS Visual Summary",
    "description": "A simple shiny app showing MLS team statistics for the 2021 season.",
    "author": [
      {
        "name": "Ben Wagner",
        "url": {}
      }
    ],
    "date": "2021-10-14",
    "categories": [],
    "contents": "\r\n\r\n\r\n\r\nThis post highlights my Shiny app creation for my Advanced Data Science class. The app shows the user simple summary statistics of the 27 Major League Soccer teams during for the most recently season (2021). The dropdown menu allows the user to choose 1 of 11 stats, including Goals For, Expected Goals, or Expected Points. This data was provided by one of my favorite websites, American Soccer Analysis.\r\nI plan to continue to updgrade this app with other visual and user friendly features. However, for the sake of a deadline, I had to keep the app simple. Feel free to check in again in the next coming months to see the finished product. Here is the link to my Github to see the code for the app!\r\n\r\n\r\n\r\n",
    "preview": "Posts/2021-10-14-mlsshiny/MLS logos.jpg",
    "last_modified": "2021-10-14T15:25:09-05:00",
    "input_file": {}
  },
  {
    "path": "Posts/2021-10-05-emmytidytues/",
    "title": "Tidy Tuesday: Emmys (Oct. 5)",
    "description": "My Tidy Tuesday Submission for Week 41",
    "author": [
      {
        "name": "Ben Wagner",
        "url": {}
      }
    ],
    "date": "2021-10-05",
    "categories": [],
    "contents": "\r\n\r\n\r\n    Downloading file 1 of 1: `nominees.csv`\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\nThis entry highlights my Tidy Tuesday submission for the week of October 5! There was a problem with the latest dataset on Github, so I just resorted to an older file. Thus, I created my vis using the Emmy Awards data provided by emmys.com\r\nThis weeks visualization highlights the major distributors and the number of Emmys they win each year. I created an animated bar plot to show how many Emmys each group won from 2000-2021, excluding 2014 for a lack of data. To accomplish this goal, I first grouped the dataset by distributor and year, then counted the number of occurrences each distributor made in that year. I felt that an animation was beneficial, rather than faceting, because you can see the change in success as the age of streaming movies/TV has taken over the world.\r\nIf you liked this week’s viz, please go like or even retweet on my twitter post. I’d love to show my visualizations to as many people as possible, so your support is very much appreciated. Also if you’d like to see my source code, use this link to my Github!\r\n\r\n\r\n\r\n",
    "preview": "Posts/2021-10-05-emmytidytues/Emmy_logo.jpg",
    "last_modified": "2021-10-05T14:01:33-05:00",
    "input_file": {}
  },
  {
    "path": "Posts/2021-09-21-tidy-tuesday-billboard-top-100-sept-22/",
    "title": "Tidy Tuesday: Billboard Top 100 (Sept. 21)",
    "description": "My Tidy Tuesday submission for Week 39",
    "author": [
      {
        "name": "Ben Wagner",
        "url": {}
      }
    ],
    "date": "2021-09-21",
    "categories": [],
    "contents": "\r\n\r\n\r\n\r\nI’m super excited to publish my first blog post on my website! This entry highlights my Tidy Tuesday submission for the week of September 21st. This week’s dataset contains information on the weekly Billboard Top 100 songs and each song’s audio features. The data comes from Data.World, scraped by Sean Miller on Billboard and Spotify.\r\nLooking at my visualization, I decided to show the relationship between the how long each #1 hit stayed at the top, and the level of danceability the song contains. People love to dance. The more we dance, the more we play those top hits. Thus, they continue to stay at the top for longer! In order to do this, I filtered out all the songs that didn’t peak at #1 and then created a new variable which counted the number of weeks it stayed at the top. From there, I created a scatter plot in order to show each song as a point. Also, it is easier to show the linear relationship (line of best fit) between the two variables. Finally, the color scheme seemed like the perfect aethstetically pleasing theme that makes it all pop.\r\nIf you liked my viz, please go like or even retweet on my twitter post. I’d love to show my visualizations to as many people as possible, so your support is very much appreciated. Also if you’d like to see my source code, use this link to my Github!\r\n\r\n\r\n\r\n",
    "preview": "Posts/2021-09-21-tidy-tuesday-billboard-top-100-sept-22/Tidy_Tuesday_Sept21.png",
    "last_modified": "2021-09-22T12:38:37-05:00",
    "input_file": {}
  }
]
